

var teststring = function (data) {



   

    let textLength = data[0].length;
    for (let i = 1; i < data.length; i++) {
        textLength = Math.min(textLength, data[i].length);
    }



    let textprefix = "";
    if (data == null || data.length == 0) {
        return textprefix;
    }
  


    for (let i = 0; i < textLength; i++) {
        let value = data[0][i];
        for (let j = 0; j < data.length; j++) {
            if (data[j][i] != value) {
                return textprefix;
            }
        }
        textprefix += value;
    }



    return textprefix;





        
 

};


console.log("ทดสอบค้นหาเมื่ออักษรนำหน้าเหมือนกันมากที่สุด = "+teststring(["flower", "flow", "flight"]));
console.log("ค่าว่างเมื่ออักษรนำหน้ามีไม่มาก = ค่าว่าง"+teststring(["dog", "racecar", "car"]));

/*การทำงานของโปรแกรม 
1.หาความยาวสตริงขั้นต่ำ: ต่อไป, โปรแกรมหาความยาวสตริงที่น้อยที่สุดในรายการ เพื่อใช้เป็นขีดจำกัดในการเปรียบเทียบอักขระ เพราะไม่จำเป็นต้องเปรียบเทียบอักขระนอกเหนือจากความยาวสตริงที่สั้นที่สุด.


2. โปรแกรมเริ่มต้นด้วยการตรวจสอบว่ารายการสตริงที่ให้มาเป็น null หรือมีความยาวเป็น 0 หรือไม่ ถ้าใช่, ฟังก์ชันจะส่งคืนสตริงว่างเพราะไม่มีคำนำหน้าที่เหมือนกันเลยในรายการที่ว่างเปล่าหรือไม่มีอยู่จริง.


3.เปรียบเทียบอักขระและหาคำนำหน้าที่เหมือนกัน โปรแกรมจะทำการ วนลูปผ่านแต่ละอักขระของสตริงที่มีความยาวน้อยที่สุด ในแต่ละการวนลูป, มันจะเช็คว่าอักขระนั้นๆ ตรงกันในทุกๆ สตริงที่อยู่ในรายการหรือไม่ ถ้าอักขระนั้นตรงกันในทุกสตริง, อักขระนั้นจะถูกเพิ่มเข้าไปในคำนำหน้าที่เหมือนกัน.

4.ส่งคืนคำนำหน้าที่เหมือนกันยาวที่สุด  หลังจากการวนลูปสิ้นสุด, คำนำหน้าที่เหมือนกันที่ยาวที่สุดที่พบจะถูกส่งคืนเป็นผลลัพธ์ของฟังก์ชัน



ตัวอย่างการทำงานของโปรแกรม และและผลลัพธ์:

ถ้ารายการสตริงที่ให้มาคือ ["flower", "flow", "flight"] ฟังก์ชันจะส่งคืนคำนำหน้าที่เหมือนกันยาวที่สุดคือ "fl"
ถ้ารายการสตริงที่ให้มาคือ ["dog", "racecar", "car"] ฟังก์ชันจะส่งคืนสตริงว่างเนื่องจากไม่มีคำนำหน้าที่เหมือนกันในรายการสตริงเหล่านั้น
*/